app/workers/redis_event_worker.rb

SELECT "datetimes".* FROM "datetimes" ORDER BY "datetimes"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def perform
    last_request_time = Datetime.last&.last_request_time