app/controllers/trigger_controller.rb

  def save_datetime_to_database
    Datetime.create(last_request_time: Time.now)
---
INSERT INTO "datetimes" ("last_request_time", "created_at", "updated_at") VALUES (?, ?, ?)  [["last_request_time", "2023-05-19 15:22:47.111292"], ["created_at", "2023-05-19 15:22:47.117151"], ["updated_at", "2023-05-19 15:22:47.117151"]]

  def send_event_to_redis
    current_time = Time.now
    last_request_time = Datetime.last&.last_request_time
---
SELECT "datetimes".* FROM "datetimes" ORDER BY "datetimes"."id" DESC LIMIT ?  [["LIMIT", 1]]